In [1]:
print("hello world")

hello world

In [2]:
# two data types

In [3]:
#1. series - one dimensional
import pandas as pd
series= pd.Series(["BMW","TOYOTA","HONDA"])

In [4]:
series

0       BMW
1    TOYOTA
2     HONDA
dtype: object

In [5]:
Colours= pd.Series(["Red","Blue","white"])
Colours

0      Red
1     Blue
2    white
dtype: object

In [6]:
#2. Data Frame- 2 dimensional uses key and value same as dictionary most commonly used 
Car_Data=pd.DataFrame({"CAR MAKE":series, "COlOUR":Colours})
Car_Data

  CAR MAKE COlOUR
0      BMW    Red
1   TOYOTA   Blue
2    HONDA  white

#Import dATA

In [36]:
Car_Sales= pd.read_csv("7.1 car-sales.csv")

In [37]:
Car_Sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

#Exporting a DAta frame

In [9]:
Car_Sales.to_csv("exported-car-sales.csv")

In [10]:
exported_car_sales= pd.read_csv("exported-car-sales.csv")

In [11]:
exported_car_sales

   Unnamed: 0    Make Colour  Odometer (KM)  Doors       Price
0           0  Toyota  White         150043      4   $4,000.00
1           1   Honda    Red          87899      4   $5,000.00
2           2  Toyota   Blue          32549      3   $7,000.00
3           3     BMW  Black          11179      5  $22,000.00
4           4  Nissan  White         213095      4   $3,500.00
5           5  Toyota  Green          99213      4   $4,500.00
6           6   Honda   Blue          45698      4   $7,500.00
7           7   Honda   Blue          54738      4   $7,000.00
8           8  Toyota  White          60000      4   $6,250.00
9           9  Nissan  White          31600      4   $9,700.00

##DESCRIBE DATA

In [12]:
#attributes
Car_Sales.dtypes

Car_Sales.columns

Car_Sales.index

RangeIndex(start=0, stop=10, step=1)

In [13]:
#Functions
Car_Sales.describe()

Car_Sales.info()

#Car_Sales.mean()

Car_Sales.sum()

Car_Sales["Price"].sum()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Make           10 non-null     object
 1   Colour         10 non-null     object
 2   Odometer (KM)  10 non-null     int64
 3   Doors          10 non-null     int64
 4   Price          10 non-null     object
dtypes: int64(2), object(3)
memory usage: 532.0+ bytes

'$4,000.00$5,000.00$7,000.00$22,000.00$3,500.00$4,500.00$7,500.00$7,000.00$6,250.00$9,700.00'

#SElecting and Viewing Data in Pandas

In [14]:
Car_Sales.head()

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00

In [15]:
Car_Sales.head(6)

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00

In [16]:
Car_Sales.tail()

     Make Colour  Odometer (KM)  Doors      Price
5  Toyota  Green          99213      4  $4,500.00
6   Honda   Blue          45698      4  $7,500.00
7   Honda   Blue          54738      4  $7,000.00
8  Toyota  White          60000      4  $6,250.00
9  Nissan  White          31600      4  $9,700.00

In [17]:
#loc function used for specifying index
Car_Sales.loc()

In [18]:
Car_Sales.loc[4]

Make                Nissan
Colour               White
Odometer (KM)       213095
Doors                    4
Price            $3,500.00
Name: 4, dtype: object

In [19]:
Car_Sales.loc[:5]

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00

In [20]:
#iloc functions is used to specify Position 
Car_Sales.iloc[5]

Make                Toyota
Colour               Green
Odometer (KM)        99213
Doors                    4
Price            $4,500.00
Name: 5, dtype: object

In [21]:
Car_Sales.iloc[:5]

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00

In [22]:
animals= pd.Series([ "DOG", "CAT","MOUSE"], index=["3","5","6"])

In [23]:
animals

3      DOG
5      CAT
6    MOUSE
dtype: object

In [24]:
animals.iloc[:3]

3      DOG
5      CAT
6    MOUSE
dtype: object

animals.loc[5]  # In dont know why it is not working

In [25]:
Car_Sales[Car_Sales["Make"]=="Toyota"]

     Make Colour  Odometer (KM)  Doors      Price
0  Toyota  White         150043      4  $4,000.00
2  Toyota   Blue          32549      3  $7,000.00
5  Toyota  Green          99213      4  $4,500.00
8  Toyota  White          60000      4  $6,250.00

In [26]:
Car_Sales[Car_Sales.Make=="Toyota"]

     Make Colour  Odometer (KM)  Doors      Price
0  Toyota  White         150043      4  $4,000.00
2  Toyota   Blue          32549      3  $7,000.00
5  Toyota  Green          99213      4  $4,500.00
8  Toyota  White          60000      4  $6,250.00

In [27]:
Car_Sales[Car_Sales["Odometer (KM)"]>10000]

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

#Car_Sales[Car_Sales.Odometer (KM)>10000] # if you have space in the variables then you cannot use . method

In [28]:
Car_Sales=pd.crosstab(["Price"],["Odometer (KM)"])

In [29]:
Car_Sales.columns
Car_Sales.columns

Index(['Odometer (KM)'], dtype='object', name='col_0')

#DATA MAUPULATING

In [38]:
Car_Sales["Make"].str.lower()

0    toyota
1     honda
2    toyota
3       bmw
4    nissan
5    toyota
6     honda
7     honda
8    toyota
9    nissan
Name: Make, dtype: object

In [39]:
Car_Sales["Make"]=Car_Sales["Make"].str.lower()

In [65]:
Car_Sales

     Make Colour  Odometer (KM)  Doors       Price
0  TOYOTA  White         150043      4   $4,000.00
1   HONDA    Red          87899      4   $5,000.00
2  TOYOTA   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  NISSAN  White         213095      4   $3,500.00
5  TOYOTA  Green          99213      4   $4,500.00
6   HONDA   Blue          45698      4   $7,500.00
7   HONDA   Blue          54738      4   $7,000.00
8  TOYOTA  White          60000      4   $6,250.00
9  NISSAN  White          31600      4   $9,700.00

In [41]:
Car_Sales["Make"]=Car_Sales["Make"].str.upper()

In [42]:
Car_Sales

     Make Colour  Odometer (KM)  Doors       Price
0  TOYOTA  White         150043      4   $4,000.00
1   HONDA    Red          87899      4   $5,000.00
2  TOYOTA   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  NISSAN  White         213095      4   $3,500.00
5  TOYOTA  Green          99213      4   $4,500.00
6   HONDA   Blue          45698      4   $7,500.00
7   HONDA   Blue          54738      4   $7,000.00
8  TOYOTA  White          60000      4   $6,250.00
9  NISSAN  White          31600      4   $9,700.00

In [47]:
car_sales_missing= pd.read_csv("9.2 car-sales-missing-data.csv")

In [48]:
car_sales_missing

     Make Colour  Odometer  Doors    Price
0  Toyota  White  150043.0    4.0   $4,000
1   Honda    Red   87899.0    4.0   $5,000
2  Toyota   Blue       NaN    3.0   $7,000
3     BMW  Black   11179.0    5.0  $22,000
4  Nissan  White  213095.0    4.0   $3,500
5  Toyota  Green       NaN    4.0   $4,500
6   Honda    NaN       NaN    4.0   $7,500
7   Honda   Blue       NaN    4.0      NaN
8  Toyota  White   60000.0    NaN      NaN
9     NaN  White   31600.0    4.0   $9,700

In [49]:
car_sales_missing["Odometer"].fillna(car_sales_missing["Odometer"].mean())

0    150043.000000
1     87899.000000
2     92302.666667
3     11179.000000
4    213095.000000
5     92302.666667
6     92302.666667
7     92302.666667
8     60000.000000
9     31600.000000
Name: Odometer, dtype: float64

In [50]:
car_sales_missing

     Make Colour  Odometer  Doors    Price
0  Toyota  White  150043.0    4.0   $4,000
1   Honda    Red   87899.0    4.0   $5,000
2  Toyota   Blue       NaN    3.0   $7,000
3     BMW  Black   11179.0    5.0  $22,000
4  Nissan  White  213095.0    4.0   $3,500
5  Toyota  Green       NaN    4.0   $4,500
6   Honda    NaN       NaN    4.0   $7,500
7   Honda   Blue       NaN    4.0      NaN
8  Toyota  White   60000.0    NaN      NaN
9     NaN  White   31600.0    4.0   $9,700

In [51]:
car_sales_missing["Odometer"].fillna(car_sales_missing["Odometer"].mean(), inplace=True)

C:\Users\rebik\AppData\Local\Temp\ipykernel_8580\3620729653.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  car_sales_missing["Odometer"].fillna(car_sales_missing["Odometer"].mean(), inplace=True)

In [52]:
car_sales_missing

     Make Colour       Odometer  Doors    Price
0  Toyota  White  150043.000000    4.0   $4,000
1   Honda    Red   87899.000000    4.0   $5,000
2  Toyota   Blue   92302.666667    3.0   $7,000
3     BMW  Black   11179.000000    5.0  $22,000
4  Nissan  White  213095.000000    4.0   $3,500
5  Toyota  Green   92302.666667    4.0   $4,500
6   Honda    NaN   92302.666667    4.0   $7,500
7   Honda   Blue   92302.666667    4.0      NaN
8  Toyota  White   60000.000000    NaN      NaN
9     NaN  White   31600.000000    4.0   $9,700

In [53]:
car_sales_missing.dropna()

     Make Colour       Odometer  Doors    Price
0  Toyota  White  150043.000000    4.0   $4,000
1   Honda    Red   87899.000000    4.0   $5,000
2  Toyota   Blue   92302.666667    3.0   $7,000
3     BMW  Black   11179.000000    5.0  $22,000
4  Nissan  White  213095.000000    4.0   $3,500
5  Toyota  Green   92302.666667    4.0   $4,500

In [55]:
car_sales_missing

     Make Colour       Odometer  Doors    Price
0  Toyota  White  150043.000000    4.0   $4,000
1   Honda    Red   87899.000000    4.0   $5,000
2  Toyota   Blue   92302.666667    3.0   $7,000
3     BMW  Black   11179.000000    5.0  $22,000
4  Nissan  White  213095.000000    4.0   $3,500
5  Toyota  Green   92302.666667    4.0   $4,500
6   Honda    NaN   92302.666667    4.0   $7,500
7   Honda   Blue   92302.666667    4.0      NaN
8  Toyota  White   60000.000000    NaN      NaN
9     NaN  White   31600.000000    4.0   $9,700

In [56]:
car_sales_missing= car_sales_missing.dropna()

In [57]:
car_sales_missing

     Make Colour       Odometer  Doors    Price
0  Toyota  White  150043.000000    4.0   $4,000
1   Honda    Red   87899.000000    4.0   $5,000
2  Toyota   Blue   92302.666667    3.0   $7,000
3     BMW  Black   11179.000000    5.0  $22,000
4  Nissan  White  213095.000000    4.0   $3,500
5  Toyota  Green   92302.666667    4.0   $4,500

# so to get re value you have to import the csv value once more after using Dropna function

In [58]:
car_sales_missing=pd.read_csv("9.2 car-sales-missing-data.csv")
car_sales_missing

     Make Colour  Odometer  Doors    Price
0  Toyota  White  150043.0    4.0   $4,000
1   Honda    Red   87899.0    4.0   $5,000
2  Toyota   Blue       NaN    3.0   $7,000
3     BMW  Black   11179.0    5.0  $22,000
4  Nissan  White  213095.0    4.0   $3,500
5  Toyota  Green       NaN    4.0   $4,500
6   Honda    NaN       NaN    4.0   $7,500
7   Honda   Blue       NaN    4.0      NaN
8  Toyota  White   60000.0    NaN      NaN
9     NaN  White   31600.0    4.0   $9,700

In [59]:
#YOU CAN also use inplace= True for same result
car_sales_missing.dropna(inplace=True)

In [60]:
car_sales_missing

     Make Colour  Odometer  Doors    Price
0  Toyota  White  150043.0    4.0   $4,000
1   Honda    Red   87899.0    4.0   $5,000
3     BMW  Black   11179.0    5.0  $22,000
4  Nissan  White  213095.0    4.0   $3,500

In [61]:
#export
car_sales_missing.to_csv("car_sales-dropped.csv")

In [67]:
#creating new column
car_seats= pd.Series([5,5,5,5,5,5,5,5])
Car_Sales["Seats"]=car_seats

In [68]:
Car_Sales

     Make Colour  Odometer (KM)  Doors       Price  Seats
0  TOYOTA  White         150043      4   $4,000.00    5.0
1   HONDA    Red          87899      4   $5,000.00    5.0
2  TOYOTA   Blue          32549      3   $7,000.00    5.0
3     BMW  Black          11179      5  $22,000.00    5.0
4  NISSAN  White         213095      4   $3,500.00    5.0
5  TOYOTA  Green          99213      4   $4,500.00    5.0
6   HONDA   Blue          45698      4   $7,500.00    5.0
7   HONDA   Blue          54738      4   $7,000.00    5.0
8  TOYOTA  White          60000      4   $6,250.00    NaN
9  NISSAN  White          31600      4   $9,700.00    NaN

In [71]:
#creating new column using python list so the number of column should be same as the given column
fuel_economy=[1.2,2.3,3.4,4.5,5.4,6.7,8.9,6.998,3.4,10]
Car_Sales["Fuel_Economy"]=fuel_economy

In [72]:
Car_Sales

     Make Colour  Odometer (KM)  Doors       Price  Seats  Fuel_Economy
0  TOYOTA  White         150043      4   $4,000.00    5.0         1.200
1   HONDA    Red          87899      4   $5,000.00    5.0         2.300
2  TOYOTA   Blue          32549      3   $7,000.00    5.0         3.400
3     BMW  Black          11179      5  $22,000.00    5.0         4.500
4  NISSAN  White         213095      4   $3,500.00    5.0         5.400
5  TOYOTA  Green          99213      4   $4,500.00    5.0         6.700
6   HONDA   Blue          45698      4   $7,500.00    5.0         8.900
7   HONDA   Blue          54738      4   $7,000.00    5.0         6.998
8  TOYOTA  White          60000      4   $6,250.00    NaN         3.400
9  NISSAN  White          31600      4   $9,700.00    NaN        10.000

In [76]:
Car_Sales["Fuel Per 100KM"]=Car_Sales["Odometer (KM)"]/100*Car_Sales["Fuel_Economy"]

In [77]:
Car_Sales

,Make,Colour,Odometer (KM),Doors,Price,Seats,Fuel_Economy,Fuel Per 100KM
0,TOYOTA,White,150043,4,"$4,000.00",5.0,1.200,1800.51600
1,HONDA,Red,87899,4,"$5,000.00",5.0,2.300,2021.67700
2,TOYOTA,Blue,32549,3,"$7,000.00",5.0,3.400,1106.66600
3,BMW,Black,11179,5,"$22,000.00",5.0,4.500,503.05500
4,NISSAN,White,213095,4,"$3,500.00",5.0,5.400,11507.13000
5,TOYOTA,Green,99213,4,"$4,500.00",5.0,6.700,6647.27100
6,HONDA,Blue,45698,4,"$7,500.00",5.0,8.900,4067.12200
7,HONDA,Blue,54738,4,"$7,000.00",5.0,6.998,3830.56524
8,TOYOTA,White,60000,4,"$6,250.00",NaN,3.400,2040.00000
9,NISSAN,White,31600,4,"$9,700.00",NaN,10.000,3160.00000

In [78]:
#create a column from single value
Car_Sales["Wheels"]=4

In [79]:
Car_Sales["Passed Road Safety"]=True

In [80]:
Car_Sales

,Make,Colour,Odometer (KM),Doors,Price,Seats,Fuel_Economy,Fuel Per 100KM,Wheels,Passed Road Safety
0,TOYOTA,White,150043,4,"$4,000.00",5.0,1.200,1800.51600,4,True
1,HONDA,Red,87899,4,"$5,000.00",5.0,2.300,2021.67700,4,True
2,TOYOTA,Blue,32549,3,"$7,000.00",5.0,3.400,1106.66600,4,True
3,BMW,Black,11179,5,"$22,000.00",5.0,4.500,503.05500,4,True
4,NISSAN,White,213095,4,"$3,500.00",5.0,5.400,11507.13000,4,True
5,TOYOTA,Green,99213,4,"$4,500.00",5.0,6.700,6647.27100,4,True
6,HONDA,Blue,45698,4,"$7,500.00",5.0,8.900,4067.12200,4,True
7,HONDA,Blue,54738,4,"$7,000.00",5.0,6.998,3830.56524,4,True
8,TOYOTA,White,60000,4,"$6,250.00",NaN,3.400,2040.00000,4,True
9,NISSAN,White,31600,4,"$9,700.00",NaN,10.000,3160.00000,4,True

In [81]:
Car_Sales.dtypes

Make                   object
Colour                 object
Odometer (KM)           int64
Doors                   int64
Price                  object
Seats                 float64
Fuel_Economy          float64
Fuel Per 100KM        float64
Wheels                  int64
Passed Road Safety       bool
dtype: object

In [82]:
#to remove a column
Car_Sales.drop("Wheels",axis=1)

,Make,Colour,Odometer (KM),Doors,Price,Seats,Fuel_Economy,Fuel Per 100KM,Passed Road Safety
0,TOYOTA,White,150043,4,"$4,000.00",5.0,1.200,1800.51600,True
1,HONDA,Red,87899,4,"$5,000.00",5.0,2.300,2021.67700,True
2,TOYOTA,Blue,32549,3,"$7,000.00",5.0,3.400,1106.66600,True
3,BMW,Black,11179,5,"$22,000.00",5.0,4.500,503.05500,True
4,NISSAN,White,213095,4,"$3,500.00",5.0,5.400,11507.13000,True
5,TOYOTA,Green,99213,4,"$4,500.00",5.0,6.700,6647.27100,True
6,HONDA,Blue,45698,4,"$7,500.00",5.0,8.900,4067.12200,True
7,HONDA,Blue,54738,4,"$7,000.00",5.0,6.998,3830.56524,True
8,TOYOTA,White,60000,4,"$6,250.00",NaN,3.400,2040.00000,True
9,NISSAN,White,31600,4,"$9,700.00",NaN,10.000,3160.00000,True

In [83]:
Car_Sales.sample()

,Make,Colour,Odometer (KM),Doors,Price,Seats,Fuel_Economy,Fuel Per 100KM,Wheels,Passed Road Safety
6,HONDA,Blue,45698,4,"$7,500.00",5.0,8.9,4067.122,4,True

In [85]:
Car_Sales.sample(frac=1)

,Make,Colour,Odometer (KM),Doors,Price,Seats,Fuel_Economy,Fuel Per 100KM,Wheels,Passed Road Safety
7,HONDA,Blue,54738,4,"$7,000.00",5.0,6.998,3830.56524,4,True
0,TOYOTA,White,150043,4,"$4,000.00",5.0,1.200,1800.51600,4,True
1,HONDA,Red,87899,4,"$5,000.00",5.0,2.300,2021.67700,4,True
6,HONDA,Blue,45698,4,"$7,500.00",5.0,8.900,4067.12200,4,True
3,BMW,Black,11179,5,"$22,000.00",5.0,4.500,503.05500,4,True
2,TOYOTA,Blue,32549,3,"$7,000.00",5.0,3.400,1106.66600,4,True
5,TOYOTA,Green,99213,4,"$4,500.00",5.0,6.700,6647.27100,4,True
4,NISSAN,White,213095,4,"$3,500.00",5.0,5.400,11507.13000,4,True
9,NISSAN,White,31600,4,"$9,700.00",NaN,10.000,3160.00000,4,True
8,TOYOTA,White,60000,4,"$6,250.00",NaN,3.400,2040.00000,4,True

In [88]:
Car_Sales_shuffled=Car_Sales.sample(frac=1)

In [89]:
Car_Sales_shuffled

,Make,Colour,Odometer (KM),Doors,Price,Seats,Fuel_Economy,Fuel Per 100KM,Wheels,Passed Road Safety
6,HONDA,Blue,45698,4,"$7,500.00",5.0,8.900,4067.12200,4,True
8,TOYOTA,White,60000,4,"$6,250.00",NaN,3.400,2040.00000,4,True
5,TOYOTA,Green,99213,4,"$4,500.00",5.0,6.700,6647.27100,4,True
1,HONDA,Red,87899,4,"$5,000.00",5.0,2.300,2021.67700,4,True
2,TOYOTA,Blue,32549,3,"$7,000.00",5.0,3.400,1106.66600,4,True
3,BMW,Black,11179,5,"$22,000.00",5.0,4.500,503.05500,4,True
0,TOYOTA,White,150043,4,"$4,000.00",5.0,1.200,1800.51600,4,True
7,HONDA,Blue,54738,4,"$7,000.00",5.0,6.998,3830.56524,4,True
9,NISSAN,White,31600,4,"$9,700.00",NaN,10.000,3160.00000,4,True
4,NISSAN,White,213095,4,"$3,500.00",5.0,5.400,11507.13000,4,True

In [90]:
Car_Sales_shuffled.reset_index()

,index,Make,Colour,Odometer (KM),Doors,Price,Seats,Fuel_Economy,Fuel Per 100KM,Wheels,Passed Road Safety
0,6,HONDA,Blue,45698,4,"$7,500.00",5.0,8.900,4067.12200,4,True
1,8,TOYOTA,White,60000,4,"$6,250.00",NaN,3.400,2040.00000,4,True
2,5,TOYOTA,Green,99213,4,"$4,500.00",5.0,6.700,6647.27100,4,True
3,1,HONDA,Red,87899,4,"$5,000.00",5.0,2.300,2021.67700,4,True
4,2,TOYOTA,Blue,32549,3,"$7,000.00",5.0,3.400,1106.66600,4,True
5,3,BMW,Black,11179,5,"$22,000.00",5.0,4.500,503.05500,4,True
6,0,TOYOTA,White,150043,4,"$4,000.00",5.0,1.200,1800.51600,4,True
7,7,HONDA,Blue,54738,4,"$7,000.00",5.0,6.998,3830.56524,4,True
8,9,NISSAN,White,31600,4,"$9,700.00",NaN,10.000,3160.00000,4,True
9,4,NISSAN,White,213095,4,"$3,500.00",5.0,5.400,11507.13000,4,True

In [91]:
Car_Sales_shuffled.reset_index(drop=True,inplace=True)

In [92]:
Car_Sales_shuffled

,Make,Colour,Odometer (KM),Doors,Price,Seats,Fuel_Economy,Fuel Per 100KM,Wheels,Passed Road Safety
0,HONDA,Blue,45698,4,"$7,500.00",5.0,8.900,4067.12200,4,True
1,TOYOTA,White,60000,4,"$6,250.00",NaN,3.400,2040.00000,4,True
2,TOYOTA,Green,99213,4,"$4,500.00",5.0,6.700,6647.27100,4,True
3,HONDA,Red,87899,4,"$5,000.00",5.0,2.300,2021.67700,4,True
4,TOYOTA,Blue,32549,3,"$7,000.00",5.0,3.400,1106.66600,4,True
5,BMW,Black,11179,5,"$22,000.00",5.0,4.500,503.05500,4,True
6,TOYOTA,White,150043,4,"$4,000.00",5.0,1.200,1800.51600,4,True
7,HONDA,Blue,54738,4,"$7,000.00",5.0,6.998,3830.56524,4,True
8,NISSAN,White,31600,4,"$9,700.00",NaN,10.000,3160.00000,4,True
9,NISSAN,White,213095,4,"$3,500.00",5.0,5.400,11507.13000,4,True

In [93]:
Car_Sales_shuffled["Odometer (KM)"]=Car_Sales_shuffled["Odometer (KM)"].apply(lambda x:x/1.6)

In [94]:
Car_Sales_shuffled

,Make,Colour,Odometer (KM),Doors,Price,Seats,Fuel_Economy,Fuel Per 100KM,Wheels,Passed Road Safety
0,HONDA,Blue,28561.250,4,"$7,500.00",5.0,8.900,4067.12200,4,True
1,TOYOTA,White,37500.000,4,"$6,250.00",NaN,3.400,2040.00000,4,True
2,TOYOTA,Green,62008.125,4,"$4,500.00",5.0,6.700,6647.27100,4,True
3,HONDA,Red,54936.875,4,"$5,000.00",5.0,2.300,2021.67700,4,True
4,TOYOTA,Blue,20343.125,3,"$7,000.00",5.0,3.400,1106.66600,4,True
5,BMW,Black,6986.875,5,"$22,000.00",5.0,4.500,503.05500,4,True
6,TOYOTA,White,93776.875,4,"$4,000.00",5.0,1.200,1800.51600,4,True
7,HONDA,Blue,34211.250,4,"$7,000.00",5.0,6.998,3830.56524,4,True
8,NISSAN,White,19750.000,4,"$9,700.00",NaN,10.000,3160.00000,4,True
9,NISSAN,White,133184.375,4,"$3,500.00",5.0,5.400,11507.13000,4,True

In [97]:
Car_Sales_shuffled["Odometer (Miles)"]=Car_Sales_shuffled["Odometer (KM)"]

In [105]:
Car_Sales_shuffled=Car_Sales_shuffled.drop("Odometer (KM)",axis=1)

In [106]:
Car_Sales_shuffled.replace("Odometer (miles)","Doors")

,Make,Colour,Doors,Price,Seats,Fuel_Economy,Fuel Per 100KM,Wheels,Passed Road Safety,Odometer (Miles)
0,HONDA,Blue,4,"$7,500.00",5.0,8.900,4067.12200,4,True,28561.250
1,TOYOTA,White,4,"$6,250.00",NaN,3.400,2040.00000,4,True,37500.000
2,TOYOTA,Green,4,"$4,500.00",5.0,6.700,6647.27100,4,True,62008.125
3,HONDA,Red,4,"$5,000.00",5.0,2.300,2021.67700,4,True,54936.875
4,TOYOTA,Blue,3,"$7,000.00",5.0,3.400,1106.66600,4,True,20343.125
5,BMW,Black,5,"$22,000.00",5.0,4.500,503.05500,4,True,6986.875
6,TOYOTA,White,4,"$4,000.00",5.0,1.200,1800.51600,4,True,93776.875
7,HONDA,Blue,4,"$7,000.00",5.0,6.998,3830.56524,4,True,34211.250
8,NISSAN,White,4,"$9,700.00",NaN,10.000,3160.00000,4,True,19750.000
9,NISSAN,White,4,"$3,500.00",5.0,5.400,11507.13000,4,True,133184.375